{
  "resourceType": "ClinicalImpression",
  "id": "example",
  "text": {
    "status": "generated",
  },
  "identifier": [
    {
      "value": "12345"
    }
  ],
  "status": "completed",
  "description": "Record date: 2100-07-07\n\n\n\nHumalog 0-2/4-8/6-10\t111-64-17\n\nLantus 10 U hs\tXayarath\n\nPrograf 2 mg bid\n\nImuran 100 mg qhs\n\nPrednisone 2.5 mg qd starting last month\n\nOmeprazole 20 mg qd\n\nLipitor 40 mg qd\n\nToprol XL 25 mg qPM\n\nImdur 30 mg qd\n\nCoumadin 4 mg tablets (for SVC stent): 4 mg 2/7; 6 mg 5/7\n\nASA 325 mg qd\n\nCaltrate with D 1200-1500 mg per day in divided doses\n\nFosamax 70 mg qw\n\nCentrum QD\n\nFolate 1 mg qd   not taking\n\nCelexa 20 mg qd\n\n\n\nJuly 07, 2100\n\n\n\nInterim History:\t\n\nComes to review her medical problems.\n\n\n\nShe had been losing weight and feeling fatigued. She has been at her current weight for several weeks and feels that she has stabilized. Appetite has been good. \n\n\n\nHome Blood Tests:  No records. She reports that she drops from the 200's to the normal range in the morning. Her bedtime test is about 3-4 hours after summer.  \n\nRetinopathy:\tSaw Dr. Xiques in the Spring. May need laser for p-cataract film. Retinas stable.\n\nNephropathy:\tCr 1.0 in September. Saw Dr. Seuss re her Charcot foot. He put her in a boot and wheelchair for 3 weeks and it resolved well. \n\nCardiac:\tGets little tingling sensations in her anterior chest, occurring at any times. Not specifically at times of physical exercise. \n\nVascular:\tNo claudication\n\n\n\nPast Medical History: \n\nMedications: Prograf reduced.\n\n\n\nReview of Systems: \n\nGI: Feels that her abdomen is uncomfortable much of the time. Not precipitated or relieved by food. Upper and lower abdominal. No change in volume or nature of ileostomy output. She has dysphagia for liquids, sometimes with regurgitation. \n\nHad Pap and mammogram through ANC gynecologist.\n\nShe saw Dr. Seuss for sinus problems. He got an MRI. It showed a meningioma of the jugular foramen. Dr. Seuss's note indicated that she would see Dr. Martens for that and indeed she has seen Dr. New, although she says it is for a tumor on the vocal cord. \n\nHe also wanted her to see Dr. Carter about a vocal cord paralysis, and that visit is upcoming. \n\n\n\n\n\nPhysical Exam:\t\n\nLooks well.\n\nBP:   118/70\t\tP:   72, regular\n\nWt:   118.5 without shoes, down 8.5\n\nHEENT:\tAnicteric. \n\nCarotids:\tNormal pulses, without bruits\n\nChest:\tClear to auscultation\n\nHeart:\tDyskinetic prominent apical impulse. Normal S1; single S2.  S4.  2/6 systolic ejection murmur\n\nAbdomen:\tNo hepatosplenomegaly. No masses. Small epigastric hernia with mild tenderness in that area. Ileostomy. No palpable AAA. \n\nExtremities:\tNo edema.       DP 2+,=.  PT absent. Prominent mound of tissue in the plantar aspect of L foot, from Charcot changes, but with very normal skin covering.  Good foot care.\n\n\n\nImpressions and Plan:\t\n\nMany active issues.\n\nHard to assess control without data. Must bring them to visits.\n\nFor now, reduce the Lantus to 8 U since she drops overnight by history.\n\nWill need to talk with Dr. Wilson and Dr. Kowalski about their respective perspectives and figure out who is addressing the meningioma and hydrocephalus. May need to see a neurologist. \n\nRefer to Dr. Parker for evaluation of her gastrointestinal discomfort and dysphagia for liquids. I suspect a motility disorder.\n\nShe needs follow-up with Dr. Bond. \n\n1 hour; most counseling and coordination of care.\n\nA1c, Electrolytes, BUN/Creatinine, CBC, anti-gliadin antibodies, anti-transglutaminase antibodies, TSH.\n\n\n\nAppointments:\t1 month\n\n\n\ncc:\tTransplant Clinic\n\n\tCharlotte Thunder, M.D., Dan Clifford Health Care Center, 700 Alex Drive, Suite 9B,\n\n\t\t New York, NY 10001\n\n\tAnnabelle Springs, M.D., BKMC\n\n\tTommy Donaldson, M.D.\n\n\n\n\n\n\t\t\tPolly K. Grey, M.D., Ph.D.",
  "subject": {
    "reference": "Patient/example"
  },
  "effectivePeriod": {
    "start": "2014-12-06T20:00:00+11:00",
    "end": "2014-12-06T22:33:00+11:00"
  },
  "date": "2014-12-06T22:33:00+11:00",
  "assessor": {
    "reference": "Practitioner/example"
  },
  "problem": [
    {
      "display": "MVA"
    }
  ],
  "investigation": [
    {
      "code": {
        "text": "Initial Examination"
      },
      "item": [
        {
          "display": "deep laceration of the scalp (left temporo-occipital)"
        },
        {
          "display": "decreased level of consciousness"
        },
        {
          "display": "disoriented to time and place"
        },
        {
          "display": "restless"
        }
      ]
    }
  ],
  "summary": "provisional diagnoses of laceration of head and traumatic brain injury (TBI)",
  "finding": [
    {
      "itemCodeableConcept": {
        "coding": [
          {
            "system": "http://hl7.org/fhir/sid/icd-9",
            "code": "850.0"
          }
        ]
      }
    }
  ]
}
